#+title: Looking at Gemfiles
#+subtitle: making sense of Gemfile.lock
#+tags: ruby, bundler, packagemanagers, git
#+date: 2020-09-04

Bundler is the standard way for Ruby projects to specifiy
dependencies. Let's take a look at how that works, reimplement =bundle
outdated=, and be able to see the changes that took place between the
build you are using and the latest one.

* Parsing a =Gemfile.lock= directly

Let's now look at how to parse a =Gemfile.lock= of a different project,
where we don't have the original =Gemfile= handy.

When we load in the lockfile using =Bundler::LockfileParser= we only
have the gem name, version, and the source from which to get it. We
may or may not have the gemspec on our local machine, and so
additional metadata like the homepage, summary, codeurl, etc haven't
been loaded yet. Let's first print out what we have and then figure
out how to get gem information from the source, name, and version.

#+begin_src ruby :tangle gemfilelock.rb
#!/usr/bin/env ruby
require 'bundler'

def describe_lockfile file = Bundler.default_lockfile
  context = Bundler::LockfileParser.new( Bundler.read_file( file ) )
  puts "Bundler version"
  puts context.bundler_version.to_s

  puts
  puts "Dependencies"
  context.dependencies.each do |name,x|
    printf "%-20s %s\n", x.name, x.requirements_list.to_s
  end

  puts
  puts "Gems"
  context.specs.each do |s|
    printf "%-20s %-10s\n", s.name, s.version.to_s
    printf "%-10s %s\n", s.source.class, s.source.to_s
  end
end

describe_lockfile

#+end_src

#+RESULTS:
: Bundler version
: 2.1.4
:
: Dependencies
: bundler              ["~> 2.1"]
: gems                 ["~> 1.2"]
: irb                  [">= 0"]
:
: Gems
: gems                 1.2.0     
: Bundler::Source::Rubygems rubygems repository https://rubygems.org/ or installed locally
: io-console           0.5.6     
: Bundler::Source::Rubygems rubygems repository https://rubygems.org/ or installed locally
: irb                  1.2.4     
: Bundler::Source::Git https://github.com/ruby/irb (at master@9bb6562)
: reline               0.1.4     
: Bundler::Source::Rubygems rubygems repository https://rubygems.org/ or installed locally

Another thing that's interesting to note is that the version of
=bundler= itself doesn't show up in the specified gems, though it is
available from the =bundler_version= method.

* Finding outdated gem versions

If you are working with a matching set of =Gemfile= and =Gemfile.lock=
files, which most people are, there's a nifty command =bundle outdated=.
This looks though the gems that you have to see if there's a later
version released.

Let's recreate this using our =Gemfile.lock= only method so we can look
at lock files and see which gems have updated code.

First we will pull the specs out of the lockfile. Then we will loop
over them, pulling in the infomation from =rubygems= or wherever the
remote was specified. We aren't doing anything special with git
sourced gems.

#+begin_src ruby :tangle outdated.rb :results output
  #!/usr/bin/env ruby
  require 'bundler'
  require 'gems'

  def specs_from_lockfile file = Bundler.default_lockfile
    gems = {}
    context = Bundler::LockfileParser.new(Bundler.read_file(file))
    context.specs.each do |info|
      gems[info.name] = {version: info.version.to_s, source: info.source.class }
      if info.source.is_a? Bundler::Source::Rubygems
        gems[info.name][:remote] = info.source.remotes.first.to_s 
      elsif info.source.is_a? Bundler::Source::Git
        gems[info.name][:remote] = info.source.uri 
        gems[info.name][:ref] = info.source.ref
        gems[info.name][:revision] = info.source.revision
      else
        puts "Not sure how to process #{info.source.class}"
      end
    end
    gems
  end

  def add_rubygems_versions info
    info.each do |name, spec|
      if spec[:source] == Bundler::Source::Rubygems
        gems_client = Gems::Client.new( { host: spec[:remote] } )
        spec[:info] = gems_client.info( name )
      elsif spec[:source] == Bundler::Source::Git
        spec[:info] = Gems.info( name )
      else
        puts "Not sure of the source of #{name}"
      end
    end
  end

  specs = specs_from_lockfile ARGV[0] || Bundler.default_lockfile
  add_rubygems_versions( specs )

  printf "%15s  %-8s %-8s %3s %s\n", "Name", "Current", "Latest", "Old", "Info"

  specs.each do |name,info|
    info[:info] ||= {}
    current_version = info[:version]
    new_version = info[:info]["version"]
    printf "%15s  %-8s %-8s %-3s %s\n", 
           name,
           current_version,
           new_version,
           current_version == new_version ? "" : "Y",
           info[:info]["info"][0..50]
  end

#+end_src

#+RESULTS:
:            Name  Current  Latest   Old Info
:            gems  1.1.1    1.2.0    Y   Ruby wrapper for the RubyGems.org API
:      io-console  0.5.6    0.5.6        add console capabilities to IO instances.
:             irb  1.2.4    1.2.4        Interactive Ruby command-line tool for REPL (Read E
:            json  2.3.1    2.3.1        This is a JSON implementation as a Ruby extension i
:          reline  0.1.4    0.1.4        Alternative GNU Readline or Editline implementation

This is a very simple project, but we can see that the one gem that we
held back to =1.1.1= instead of the (current) latest of =1.2.0= is
outdated.

